mysql> SELECT * FROM cities;
+----+------------------------------------------+------------+--------+
| id | name                                     | population | region |
+----+------------------------------------------+------------+--------+
|  1 | Київ                                     |    2888470 | N      |
|  2 | Харків                                   |    1444540 | E      |
|  3 | Одеса                                    |    1010000 | S      |
|  4 | Дніпро                                   |     984423 | C      |
|  5 | Донецьк                                  |     932562 | E      |
|  6 | Запоріжжя                                |     758011 | E      |
|  7 | Львів                                    |     728545 | W      |
|  8 | Кривий Ріг                               |     646748 | S      |
|  9 | Миколаїв                                 |     494381 | S      |
| 10 | Маріуполь                                |     458533 | S      |
| 11 | Луганськ                                 |     417990 | E      |
| 12 | Севастополь                              |     412630 | S      |
| 13 | Вінниця                                  |     372432 | W      |
| 14 | Макіївка                                 |     348173 | E      |
| 15 | Сімферополь                              |     332608 | S      |
| 16 | Херсон                                   |     296161 | S      |
| 17 | Полтава                                  |     294695 | E      |
| 18 | Чернігів                                 |     294522 | N      |
| 19 | Черкаси                                  |     284459 | C      |
| 20 | Суми                                     |     268409 | E      |
| 21 | Житомир                                  |     268000 | N      |
| 22 | Хмельницький                             |     267891 | W      |
| 23 | Чернівці                                 |     264427 | W      |
| 24 | Горлівка                                 |     250991 | E      |
| 25 | Рівне                                    |     249477 | W      |
| 26 | Кам'янське                               |     240477 | C      |
| 27 | Кропивницький                            |     232052 | C      |
| 28 | Івано-Франківськ                         |     229447 | W      |
| 29 | Кременчук                                |     224997 | C      |
| 30 | Тернопіль                                |     217950 | W      |
| 31 | Луцьк                                    |     217082 | W      |
| 32 | Біла Церква                              |     211080 | N      |
| 33 | Краматорськ                              |     160895 | E      |
| 34 | Мелітополь                               |     156719 | S      |
| 35 | Керч                                     |     147668 | S      |
| 36 | Сєвєродонецьк                            |     130000 | E      |
| 37 | Хрустальний                              |     124000 | E      |
| 38 | Нікополь                                 |     119627 | C      |
| 39 | Бердянськ                                |     115476 | S      |
| 40 | Слов'янськ                               |     115421 | E      |
| 41 | Ужгород                                  |     115195 | W      |
| 42 | Алчевськ                                 |     111360 | E      |
| 43 | Павлоград                                |     110144 | E      |
| 44 | Євпаторія                                |     106115 | S      |
| 45 | Лисичанськ                               |     103459 | E      |
| 46 | Кам'янець-Подільський                    |     101590 | W      |
| 47 | Бровари                                  |     100374 | N      |
| 48 | Дрогобич                                 |      98015 | W      |
| 49 | Кадіївка                                 |      92132 | E      |
| 50 | Конотоп                                  |      92000 | E      |
+----+------------------------------------------+------------+--------+
50 rows in set (0.00 sec)

mysql> SELECT * FROM cities
    -> ORDER BY population DESC
    -> LIMIT 10 OFFSET 10;
+----+------------------------+------------+--------+
| id | name                   | population | region |
+----+------------------------+------------+--------+
| 11 | Луганськ               |     417990 | E      |
| 12 | Севастополь            |     412630 | S      |
| 13 | Вінниця                |     372432 | W      |
| 14 | Макіївка               |     348173 | E      |
| 15 | Сімферополь            |     332608 | S      |
| 16 | Херсон                 |     296161 | S      |
| 17 | Полтава                |     294695 | E      |
| 18 | Чернігів               |     294522 | N      |
| 19 | Черкаси                |     284459 | C      |
| 20 | Суми                   |     268409 | E      |
+----+------------------------+------------+--------+
10 rows in set (0.00 sec)

mysql> SELECT * FROM cities
    -> ORDER BY name DESC
    -> LIMIT 30;
+----+----------------------------+------------+--------+
| id | name                       | population | region |
+----+----------------------------+------------+--------+
| 18 | Чернігів                   |     294522 | N      |
| 23 | Чернівці                   |     264427 | W      |
| 19 | Черкаси                    |     284459 | C      |
| 37 | Хрустальний                |     124000 | E      |
| 22 | Хмельницький               |     267891 | W      |
| 16 | Херсон                     |     296161 | S      |
|  2 | Харків                     |    1444540 | E      |
| 41 | Ужгород                    |     115195 | W      |
| 30 | Тернопіль                  |     217950 | W      |
| 20 | Суми                       |     268409 | E      |
| 40 | Слов'янськ                 |     115421 | E      |
| 15 | Сімферополь                |     332608 | S      |
| 36 | Сєвєродонецьк              |     130000 | E      |
| 12 | Севастополь                |     412630 | S      |
| 25 | Рівне                      |     249477 | W      |
| 17 | Полтава                    |     294695 | E      |
| 43 | Павлоград                  |     110144 | E      |
|  3 | Одеса                      |    1010000 | S      |
| 38 | Нікополь                   |     119627 | C      |
|  9 | Миколаїв                   |     494381 | S      |
| 34 | Мелітополь                 |     156719 | S      |
| 10 | Маріуполь                  |     458533 | S      |
| 14 | Макіївка                   |     348173 | E      |
|  7 | Львів                      |     728545 | W      |
| 31 | Луцьк                      |     217082 | W      |
| 11 | Луганськ                   |     417990 | E      |
| 45 | Лисичанськ                 |     103459 | E      |
| 27 | Кропивницький              |     232052 | C      |
|  8 | Кривий Ріг                 |     646748 | S      |
| 29 | Кременчук                  |     224997 | C      |
+----+----------------------------+------------+--------+
30 rows in set (0.00 sec)

mysql> SELECT * FROM cities
    -> ORDER BY region, population DESC;
+----+------------------------------------------+------------+--------+
| id | name                                     | population | region |
+----+------------------------------------------+------------+--------+
|  4 | Дніпро                                   |     984423 | C      |
| 19 | Черкаси                                  |     284459 | C      |
| 26 | Кам'янське                               |     240477 | C      |
| 27 | Кропивницький                            |     232052 | C      |
| 29 | Кременчук                                |     224997 | C      |
| 38 | Нікополь                                 |     119627 | C      |
|  2 | Харків                                   |    1444540 | E      |
|  5 | Донецьк                                  |     932562 | E      |
|  6 | Запоріжжя                                |     758011 | E      |
| 11 | Луганськ                                 |     417990 | E      |
| 14 | Макіївка                                 |     348173 | E      |
| 17 | Полтава                                  |     294695 | E      |
| 20 | Суми                                     |     268409 | E      |
| 24 | Горлівка                                 |     250991 | E      |
| 33 | Краматорськ                              |     160895 | E      |
| 36 | Сєвєродонецьк                            |     130000 | E      |
| 37 | Хрустальний                              |     124000 | E      |
| 40 | Слов'янськ                               |     115421 | E      |
| 42 | Алчевськ                                 |     111360 | E      |
| 43 | Павлоград                                |     110144 | E      |
| 45 | Лисичанськ                               |     103459 | E      |
| 49 | Кадіївка                                 |      92132 | E      |
| 50 | Конотоп                                  |      92000 | E      |
|  1 | Київ                                     |    2888470 | N      |
| 18 | Чернігів                                 |     294522 | N      |
| 21 | Житомир                                  |     268000 | N      |
| 32 | Біла Церква                              |     211080 | N      |
| 47 | Бровари                                  |     100374 | N      |
|  3 | Одеса                                    |    1010000 | S      |
|  8 | Кривий Ріг                               |     646748 | S      |
|  9 | Миколаїв                                 |     494381 | S      |
| 10 | Маріуполь                                |     458533 | S      |
| 12 | Севастополь                              |     412630 | S      |
| 15 | Сімферополь                              |     332608 | S      |
| 16 | Херсон                                   |     296161 | S      |
| 34 | Мелітополь                               |     156719 | S      |
| 35 | Керч                                     |     147668 | S      |
| 39 | Бердянськ                                |     115476 | S      |
| 44 | Євпаторія                                |     106115 | S      |
|  7 | Львів                                    |     728545 | W      |
| 13 | Вінниця                                  |     372432 | W      |
| 22 | Хмельницький                             |     267891 | W      |
| 23 | Чернівці                                 |     264427 | W      |
| 25 | Рівне                                    |     249477 | W      |
| 28 | Івано-Франківськ                         |     229447 | W      |
| 30 | Тернопіль                                |     217950 | W      |
| 31 | Луцьк                                    |     217082 | W      |
| 41 | Ужгород                                  |     115195 | W      |
| 46 | Кам'янець-Подільський                    |     101590 | W      |
| 48 | Дрогобич                                 |      98015 | W      |
+----+------------------------------------------+------------+--------+
50 rows in set (0.00 sec)

mysql> SELECT DISTINCT region FROM cities;
+--------+
| region |
+--------+
| N      |
| E      |
| S      |
| C      |
| W      |
+--------+
5 rows in set (0.00 sec)

mysql> SELECT * FROM cities
    -> ORDER BY region DESC, name DESC;
+----+------------------------------------------+------------+--------+
| id | name                                     | population | region |
+----+------------------------------------------+------------+--------+
| 23 | Чернівці                                 |     264427 | W      |
| 22 | Хмельницький                             |     267891 | W      |
| 41 | Ужгород                                  |     115195 | W      |
| 30 | Тернопіль                                |     217950 | W      |
| 25 | Рівне                                    |     249477 | W      |
|  7 | Львів                                    |     728545 | W      |
| 31 | Луцьк                                    |     217082 | W      |
| 46 | Кам'янець-Подільський                    |     101590 | W      |
| 28 | Івано-Франківськ                         |     229447 | W      |
| 48 | Дрогобич                                 |      98015 | W      |
| 13 | Вінниця                                  |     372432 | W      |
| 16 | Херсон                                   |     296161 | S      |
| 15 | Сімферополь                              |     332608 | S      |
| 12 | Севастополь                              |     412630 | S      |
|  3 | Одеса                                    |    1010000 | S      |
|  9 | Миколаїв                                 |     494381 | S      |
| 34 | Мелітополь                               |     156719 | S      |
| 10 | Маріуполь                                |     458533 | S      |
|  8 | Кривий Ріг                               |     646748 | S      |
| 35 | Керч                                     |     147668 | S      |
| 44 | Євпаторія                                |     106115 | S      |
| 39 | Бердянськ                                |     115476 | S      |
| 18 | Чернігів                                 |     294522 | N      |
|  1 | Київ                                     |    2888470 | N      |
| 21 | Житомир                                  |     268000 | N      |
| 47 | Бровари                                  |     100374 | N      |
| 32 | Біла Церква                              |     211080 | N      |
| 37 | Хрустальний                              |     124000 | E      |
|  2 | Харків                                   |    1444540 | E      |
| 20 | Суми                                     |     268409 | E      |
| 40 | Слов'янськ                               |     115421 | E      |
| 36 | Сєвєродонецьк                            |     130000 | E      |
| 17 | Полтава                                  |     294695 | E      |
| 43 | Павлоград                                |     110144 | E      |
| 14 | Макіївка                                 |     348173 | E      |
| 11 | Луганськ                                 |     417990 | E      |
| 45 | Лисичанськ                               |     103459 | E      |
| 33 | Краматорськ                              |     160895 | E      |
| 50 | Конотоп                                  |      92000 | E      |
| 49 | Кадіївка                                 |      92132 | E      |
|  6 | Запоріжжя                                |     758011 | E      |
|  5 | Донецьк                                  |     932562 | E      |
| 24 | Горлівка                                 |     250991 | E      |
| 42 | Алчевськ                                 |     111360 | E      |
| 19 | Черкаси                                  |     284459 | C      |
| 38 | Нікополь                                 |     119627 | C      |
| 27 | Кропивницький                            |     232052 | C      |
| 29 | Кременчук                                |     224997 | C      |
| 26 | Кам'янське                               |     240477 | C      |
|  4 | Дніпро                                   |     984423 | C      |
+----+------------------------------------------+------------+--------+
50 rows in set (0.00 sec)

mysql> Terminal close -- exit!
